In [1]:
import pandas as pd
import MySQLdb
from datetime import datetime,timedelta

In [2]:
Anio='2019'
Mes='03'
Dia_act='26'

In [3]:
# nombre de los archivos Demografico
nom_actual_dem='..\..\..\BASES DATATOOLS\ASIGNACION\\2019\\ENERO\Sistema de cobro_'+Dia_act+'_'+Mes+'_'+Anio+'.xlsx'
nombre_hoja_dem='Demografico'

In [4]:
asignacion_actual_dem=pd.read_excel(open(nom_actual_dem,'rb'), sheet_name=nombre_hoja_dem, dtype={"IDENTIFICACION_DEUDOR": str,'TELEFONO':str})

In [5]:
asignacion_actual_dem['ASIGNADO']='SI'
asig_demo=asignacion_actual_dem[['TELEFONO','ASIGNADO']]

In [6]:
db2 = MySQLdb.connect(host="172.18.55.99",    # tu host, usualmente localhost
                     user="comandato",         # tu usuario
                     passwd="comandato123",  # tu password
                     db="call_center")        # el nombre de la base de datos

In [7]:
cur2= db2.cursor()

In [8]:
consulta="""SELECT id FROM call_center.campaign where queue in ('3333','3334');"""
campañas=pd.read_sql(consulta, con=db2)

In [9]:
campañas.head()

    id
0  782
1  784
2  787
3  795
4  799

In [10]:
pull=''
for campaña in campañas.itertuples():
    pull=pull+str(campaña.id)+','

In [11]:
campañas_tip='('+pull[:-1]+')'

In [12]:
campañas_tip

'(782,784,787,795,799,807,813)'

In [13]:
consulta2="SELECT  id,phone as 'TELEFONO' FROM call_center.calls where id_campaign in"+campañas_tip+ "and status is null;"
llamadas = pd.read_sql(consulta2, con=db2)

In [14]:
llamadas.head()

        id    TELEFONO
0  3734393  0994446711
1  3734394  0969520456
2  3734395  0989805145
3  3734396  0998562549
4  3734397  0989882331

In [15]:
verificacion = pd.merge(llamadas,asig_demo,on=['TELEFONO'],how='left')

In [16]:
verificacion.drop_duplicates(['id'], keep='first',inplace=True)

In [17]:
verificacion[verificacion['ASIGNADO']=='SI'].TELEFONO.count()

20178

In [18]:
eliminar=verificacion[verificacion['ASIGNADO'].isnull()]

In [19]:
eliminar.head()

           id    TELEFONO ASIGNADO
60    3734436  0999629939      NaN
227   3734572  0985452247      NaN
948   3735134   043848014      NaN
1446  3735568  0992304147      NaN
1673  3735771  0985808959      NaN

In [20]:
cont=0
cont1=0
for row in eliminar.itertuples():
    delete1 = """ DELETE FROM `call_center`.`call_attribute` WHERE `id_call`='{0}'; """.format(row.id)
    try:
        cur2.execute(delete1)
        db2.commit()
        cont=cont+1
    except:
        db2.rollback()
    delete2 = """ DELETE FROM `call_center`.`calls` WHERE `id`='{}'; """.format(row.id)
    try:
        cur2.execute(delete2)
        db2.commit()
        cont1=cont1+1
    except:
        db2.rollback()
print(cont)
print(cont1)

111
111

In [21]:
nuevo_archivo='NUMEROS POR GESTIONAR PREDICTIVA DATATOOLS.xlsx'
writer = pd.ExcelWriter(nuevo_archivo, engine='xlsxwriter')
llamadas.to_excel(writer,sheet_name='BASE')
worksheet = writer.sheets['BASE']
writer.save()